---
kind: property
id: P:Autodesk.Revit.DB.Categories.Size
source: html/63fd3a53-f8b8-77e3-4100-cbb069c7af49.htm
---
# Autodesk.Revit.DB.Categories.Size Property

The total number of top-level categories in the document.

## Syntax (C#)
```csharp
public override int Size { get; }
```